const questions = [
  { // вопрос:
    name: `Величина, значения которых меняются в процессе исполнения алгоритма, называются: `,
    //варинаты ответы:
    answer: [`Постоянными`, `Константами`, `Переменными`, `Табличными`],
    //правильный ответ
    trueAnswer: 'Переменными',
  },
  { // вопрос:
    name: `Алгоритмом можно считать:`,
    //варинаты ответы:
    answer: [`описание процесса решения квадратного уравнения`, `технический паспорт автомобиля`, `список класса в журнале`, `расписание уроков`],
    //правильный ответ
    trueAnswer: 'описание процесса решения квадратного уравнения',
  },
  { // вопрос:
    name: `Величина, значения которых меняются в процессе исполнения алгоритма, называются: `,
    //варинаты ответы:
    answer: [`Постоянными`, `Константами`, `Переменными`, `Табличными`],
    //правильный ответ
    trueAnswer: 'Переменными',
  },
];
export default questions;
