const questions = [
  {
    // вопрос:
    name: `Величина, значения которых меняются в процессе исполнения алгоритма, называются: `,
    //варинаты ответы:
    answer: [`Постоянными`, `Константами`, `Переменными`, `Табличными`],
    //правильный ответ:
    trueAnswer: "Переменными",
  },
  {
    // вопрос:
    name: `Алгоритмом можно считать:`,
    //варинаты ответы:
    answer: [
      `описание процесса решения квадратного уравнения`,
      `технический паспорт автомобиля`,
      `список класса в журнале`,
      `расписание уроков`,
    ],
    //правильный ответ:
    trueAnswer: "описание процесса решения квадратного уравнения",
  },
  {
    // вопрос:
    name: `Определенная
    последовательность действий, которую нужно выполнить для решения конкретной
    задачи называется…`,
    //варинаты ответы:
    answer: [
      `исполнителем`,
      `программой`,
      `алгоритмом`,
      `системой команд исполнителя`,
    ],
    //правильный ответ:
    trueAnswer: "системой команд исполнителя",
  },
  {
    // вопрос:
    name: `Выберите тип величины,
    который следует использовать для обозначения количества студентов в группе:`,
    //варинаты ответы:
    answer: [
      `числовой целый`,
      `числовой вещественный`,
      `строковый`,
      `логический`,
    ],
    //правильный ответ:
    trueAnswer: "числовой целый",
  },
  {
    // вопрос:
    name: `Алгоритм, в котором в
    зависимости от условия выполняется одна или другая последовательность команд
    называется`,
    //варинаты ответы:
    answer: [
      `Линейным`,
      `Циклическим`,
      `Основной
    программой`,
      `Ветвящимся`,
    ],
    //правильный ответ
    trueAnswer: "Линейным",
  },
  {
    // вопрос:
    name: `Величина, к которой обращаю
    тся по имени, принимающая различные значения в ходе 
    выполнения программы, называется:`,
    //варинаты ответы:
    answer: [],
    //правильный ответ
    trueAnswer: "переменная",
  },
  {
    // вопрос:
    name: `Последовательность действий, допустимых для исполнителя, - это`,
    //варинаты ответы:
    answer: [`программа`, `алгоритм`, `команда`, `система команд`],
    //правильный ответ
    trueAnswer: "алгоритм",
  },
  {
    // вопрос:
    name: `Команда, у которой действия выполняются после проверки условия, называются ...`,
    //варинаты ответы:
    answer: [`командой цикла`, `командой ветвления`, `простой командой`, `Процедурой`],
    //правильный ответ
    trueAnswer: "командой ветвления",
  },
  {
    // вопрос:
    name: `Тип, описывающий устройства объектов?`,
    //варинаты ответы:
    answer: [],
    //правильный ответ
    trueAnswer: 'класс',
  },
  {
    // вопрос:
    name: `Каким, словом объявляется переменная?`,
    //варинаты ответы:
    answer: [],
    //правильный ответ
    trueAnswer: 'var',
  },
  {
    // вопрос:
    name: `Программа, расширяющая возможности программного пакета?`,
    //варинаты ответы:
    answer: [`процедура`, `встраиваемый модуль`, `функция`, `анимация`],
    //правильный ответ
    trueAnswer: 'встраиваемый модуль',
  },
];
export default questions;
