const questions = [
  {
    // вопрос:
    name: `Величина, значения которых меняются в процессе исполнения алгоритма, называются: `,
    //варинаты ответы:
    answer: [`Постоянными`, `Константами`, `Переменными`, `Табличными`],
    //правильный ответ:
    trueAnswer: "Переменными",
  },
  {
    // вопрос:
    name:"Кто гей?",
    //этот массив нужен программе, его не трогать:
    answer: [],
    //правильный ответ:
    trueAnswer: "я",
  },
  {
    // вопрос:
    name: `Алгоритмом можно считать:`,
    //варинаты ответы:
    answer: [
      `описание процесса решения квадратного уравнения`,
      `технический паспорт автомобиля`,
      `список класса в журнале`,
      `расписание уроков`,
    ],
    //правильный ответ:
    trueAnswer: "описание процесса решения квадратного уравнения",
  },
  {
    // вопрос:
    name: `Определенная
    последовательность действий, которую нужно выполнить для решения конкретной
    задачи называется…`,
    //варинаты ответы:
    answer: [
      `исполнителем`,
      `программой`,
      `алгоритмом`,
      `системой команд исполнителя`,
    ],
    //правильный ответ:
    trueAnswer: "системой команд исполнителя",
  },
  {
    // вопрос:
    name: `Выберите тип величины,
    который следует использовать для обозначения количества студентов в группе:`,
    //варинаты ответы:
    answer: [
      `числовой целый`,
      `числовой вещественный`,
      `строковый`,
      `логический`,
    ],
    //правильный ответ:
    trueAnswer: "числовой целый",
  },
  {
    // вопрос:
    name: `Алгоритм, в котором в
    зависимости от условия выполняется одна или другая последовательность команд
    называется`,
    //варинаты ответы:
    answer: [`Линейным`, `Циклическим`, `Основной
    программой`, `Ветвящимся`],
    //правильный ответ
    trueAnswer: 'Линейным',
  },
  {
    // вопрос:
    name: `Величина, к которой обращаю
    тся по имени, принимающая различные значения в ходе 
    выполнения программы, называется:`,
    //варинаты ответы:
    answer: [],
    //правильный ответ
    trueAnswer: 'переменная',
  },
  // {
  //   // вопрос:
  //   name: ``,
  //   //варинаты ответы:
  //   answer: [``, ``, ``, ``],
  //   //правильный ответ
  //   trueAnswer: '',
  // },
  // {
  //   // вопрос:
  //   name: ``,
  //   //варинаты ответы:
  //   answer: [``, ``, ``, ``],
  //   //правильный ответ
  //   trueAnswer: '',
  // },
  // { // вопрос:
  // name: ``,
  // варинаты ответы:
  // answer: [``, ``, ``, ``],
  // правильный ответ
  // trueAnswer: '',
  // },
];
export default questions;
