const questions = [
  { // вопрос:
    name: `Ты гей?`,
    //варинаты ответы:
    answer: [`да`, `нет`, `да`, `да`],
    //правильный ответ
    trueAnswer: 'нет',
  },
  { // вопрос:
    name: `21`,
    //варинаты ответы:
    answer: [`1`, `3`, `4`, `2`],
    //правильный ответ
    trueAnswer: 'нет',
  },
  { // вопрос:
    name: `234234`,
    //варинаты ответы:
    answer: [`1`, `3`, `4`, `2`],
    //правильный ответ
    trueAnswer: '3',
  },
  { // вопрос:
    name: `23424`,
    //варинаты ответы:
    answer: [`1`, `3`, `4`, `2`],
    //правильный ответ
    trueAnswer: 'нет',
  },
];
export default questions;
